//时钟频率是50MHZ
//流水灯实现每过1s灯交替亮
// 流水灯对应内存地址0x2000, 0x2001,

//将0x6100存入r2寄存器，对应数字是50000 / 2左右
//将0x0400存入r3寄存器，对应数字是1000左右
// 流水灯对应内存地址0x2000, 0x2001, 0x2002, 0x2003, 0x2004, 0x2005, 0x2006
//创建内层循环，从0开始，每次加1，直到r4等于r2，结束循环,指令前进两条
//后退两条指令，也就是跳转到内层循环的起始位置
//跳转到PC = pc + (-4) 的位置，也就是跳出内层循环，执行外层循环
lui r2, 0110 0001   
lui r3, 0000 0100
lui r4, 2000 0000
addi r9, r4, 0110
addi r7, r7, 0001
addi r8, r8, 1111

addi r5, r5, 0001
ble r2, r5, 1111

lui r5, r5, 0000
addi r6, r6, 0001
beq r3, r6, 1100

// 将led灯的亮灭状态写入内存地址0x2000, 0x2001,0x2003, 0x2004, 0x2005, 0x2006
//sb rs1, offset(rs2)

lui r6, r6, 0000
sb r7,0000(r4)
addi r4, r4, 0001
beq r4, r9, 0010
jal r0, 1111 0111
lui r4, 2000 0000

